"""
Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
   На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
   Кількість символів в блоках - та, яка введена в другому параметрі.
   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі 
   (наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього блоку символів?)
   В репозиторій додайте і ті файли, по яким робили тести.
   Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл, а отримане "вікно" 
   символів відцентрувати щодо середини файла і взяти необхідну кількість. В разі необхідності заокруглення одного чи обох параметрів - дивіться на свій розсуд.
"""


def print_blocks(myfile, num):
    with open(myfile, "r") as file:
        old_file_position = file.tell()
        file.seek(0, 2)
        size = file.tell()
        if num * 3 <= size:
            file.seek(old_file_position)
            first = file.read(num)
            center = size // 2
            file.seek(center - num // 2)
            mid = file.read(num)
            file.seek(size - num)
            end = file.read(num)
            print([first, mid, end])
        else:
            print("Can't take more symbols than available")


print_blocks("test.txt", 3)
print_blocks("test2.txt", 4)
