"""
Створити програму-емулятор світлофора для авто і пішоходів.
Після запуска програми на екран виводиться в лівій половині - колір автомобільного, а в правій - пішохідного світлофора.
Кожну секунду виводиться поточні кольори. Через декілька ітерацій - відбувається зміна кольорів - логіка така сама як і в звичайних світлофорах.
"""

import time

light_peds = ["Green"] * 6 + ["Red"] * 6
light_cars = ["Red"] * 4 + ["Yellow"] * 2 + ["Green"] * 4 + ["Yellow"] * 2

width = len(light_cars)

while True:
    for car, ped in zip(light_cars, light_peds):
        print(f"{car.ljust(width)}{ped}")
        time.sleep(1)